app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "COrona"], ["room_number", 2], ["created_at", "2020-03-15 03:34:26.409678"], ["updated_at", "2020-03-15 03:34:26.409678"]]
---
  def create
    # @school_class=SchoolClass.new
    # @school_class.title=params[:school_class][:title]
    # @school_class.room_number=params[:school_class][:room_number]
    # @school_class.save
    @school_class=SchoolClass.create(school_class_params)